/* Задачи на работу с массивами в JavaScript */

let a;
let b;

/* Работа с concat */
/* 1. Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе. */
console.log('1. Объедините два массив.');
a = [1, 2, 3];
b = [4, 5, 6];
console.log(`[${a}]+[${b}]=[${a.concat(b)}]`);

/* Работа с reverse */
/* 2. Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1]. */
console.log('2. Дан массив [1, 2, 3]. Сделайте из него массив [3, 2, 1].');
a = [1, 2, 3];
b = a.reverse();
console.log(`revers([${a}])=[${b}]`);

/* Работа с push, unshift */
/* 3. Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6. */
console.log(('3. Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.'));
a = [1, 2, 3];
b = [];
b = b.concat(a);
a.push(4, 5, 6);
console.log(`[${b}]+[4,5,6]=[${a}]`);

/* 4. Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6. */
console.log(('3. Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.'));
a = [1, 2, 3];
b = [];
b = b.concat(a);
a.unshift(4, 5, 6);
console.log(`[4,5,6]+[${b}]=[${a}]`);

/* Работа с shift, pop */

/* 5. Дан массив. Выведите на экран первый элемент и удалите его. */
a = ['js', 'css', 'jq'];
console.log(`It was: [${a}]. I delete a[0]=${a.shift()}. Has become: [${a}]`);

/* 6. Дан массив. Выведите на экран последний элемент и удалите его. */
a = ['js', 'css', 'jq'];
console.log(`It was: [${a}]. I delete a[${a.length - 1}]=${a.pop()}. Has become: [${a}]`);

/* Работа со slice */

/* 7. Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3]. */
console.log('7. Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].');
a = [1, 2, 3, 4, 5];
b = a.slice(0, 3);
console.log(`a=[${a}], b=[${b}]`);

/* 8. Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3]. */
console.log('8. Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [2, 3, 4].');
a = [1, 2, 3, 4, 5];
b = a.slice(1, 4);
console.log(`a=[${a}], b=[${b}]`);

/* Работа с splice */

/* 9. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5]. */
console.log('9. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].');
a = [1, 2, 3, 4, 5];
b = [];
b = b.concat(a);
a.splice(1, 2);
console.log(`It was: [${b}]. Has become: [${a}]`);

/* 10. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4]. */
console.log('10. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4].');
a = [1, 2, 3, 4, 5];
b = [];
b = b.concat(a);
b.splice(0, 1);
b.splice(3, 1);
console.log(`It was: [${a}]. Has become: [${b}]`);

/* 11. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5]. */
console.log('11. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, \'a\', \'b\', \'c\', 4, 5].');
a = [1, 2, 3, 4, 5];
b = [];
b = b.concat(a);
b.splice(3, 0, 'a', 'b', 'c');
console.log(`a=[${a}], b=[${b}]`);

/* 12. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e']. */
console.log('12. Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, \'a\', \'b\', 2, 3, 4, \'c\', 5, \'e\'].');
a = [1, 2, 3, 4, 5];
b = [];
b = b.concat(a);
b.splice(1, 0, 'a', 'b');
b.splice(6, 0, 'c');
b.splice(8, 0, 'e');
console.log(`It was: [${a}]. Has become: [${b}]`);

/* Работа с sort */

/* 13. Дан массив [3, 4, 1, 2, 7]. Отсортируйте его. */
console.log('13. Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.');
a = [3, 4, 1, 2, 7];
b = [];
b = b.concat(a);
a.sort();
console.log(`It was: [${b}]. Has become: [${a}]`);

/* 14. Дан объект {js:'test', jq: 'hello', css: 'world'}. Получите массив его ключей. */
console.log('14. Дан объект {js:\'test\', jq: \'hello\', css: \'world\'}. Получите массив его ключей.');
a = {js: 'test', jq: 'hello', css: 'world'};
b = Object.keys(a);
console.log(a, '. Object.keys:', b);
